In [19]:
import pandas as pd

In [20]:
df=pd.read_csv(r"c:\DATA SCIENCE\EDA\data sets\mehfil_dilsukhnagar_revenue_jan_mar_2025.csv")
df.head()

,Date,Item Name,Quantity,Price per Unit,Total Price,Order Type,Branch
0,2025-01-01,Chicken Biryani,1,220,220,Online,Dilsukhnagar
1,2025-01-01,Jeera Rice,2,100,200,Dine-In,Dilsukhnagar
2,2025-01-01,Chicken Biryani,1,220,220,Online,Dilsukhnagar
3,2025-01-01,Butter Naan,1,30,30,Dine-In,Dilsukhnagar
4,2025-01-01,Chicken Biryani,5,220,1100,Takeaway,Dilsukhnagar

In [21]:
df.shape

(3123, 7)

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3123 entries, 0 to 3122
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Date            3123 non-null   object
 1   Item Name       3123 non-null   object
 2   Quantity        3123 non-null   int64
 3   Price per Unit  3123 non-null   int64
 4   Total Price     3123 non-null   int64
 5   Order Type      3123 non-null   object
 6   Branch          3123 non-null   object
dtypes: int64(3), object(4)
memory usage: 170.9+ KB

In [23]:
df.describe()

          Quantity  Price per Unit  Total Price
count  3123.000000     3123.000000  3123.000000
mean      2.952930      140.691643   420.374640
std       1.429989       87.296402   357.749506
min       1.000000       20.000000    20.000000
25%       2.000000       40.000000   120.000000
50%       3.000000      130.000000   300.000000
75%       4.000000      220.000000   600.000000
max       5.000000      300.000000  1500.000000

In [24]:
df.isnull().sum()

Date              0
Item Name         0
Quantity          0
Price per Unit    0
Total Price       0
Order Type        0
Branch            0
dtype: int64

In [25]:
df.duplicated().sum()

np.int64(308)

In [26]:
df.drop_duplicates(inplace=True)

In [27]:
df.shape

(2815, 7)

In [28]:
df.isnull().sum().sum()

np.int64(0)

In [29]:
df.duplicated().sum()

np.int64(0)

In [30]:
df.head()

,Date,Item Name,Quantity,Price per Unit,Total Price,Order Type,Branch
0,2025-01-01,Chicken Biryani,1,220,220,Online,Dilsukhnagar
1,2025-01-01,Jeera Rice,2,100,200,Dine-In,Dilsukhnagar
3,2025-01-01,Butter Naan,1,30,30,Dine-In,Dilsukhnagar
4,2025-01-01,Chicken Biryani,5,220,1100,Takeaway,Dilsukhnagar
5,2025-01-01,Paneer Butter Masala,4,180,720,Online,Dilsukhnagar

In [31]:
df.drop("Branch",axis=1,inplace=True)  
df.head()

,Date,Item Name,Quantity,Price per Unit,Total Price,Order Type
0,2025-01-01,Chicken Biryani,1,220,220,Online
1,2025-01-01,Jeera Rice,2,100,200,Dine-In
3,2025-01-01,Butter Naan,1,30,30,Dine-In
4,2025-01-01,Chicken Biryani,5,220,1100,Takeaway
5,2025-01-01,Paneer Butter Masala,4,180,720,Online